package com.jugan.tools;

import com.jugan.analysis.AnalysisData;

/**
 * @Author CL
 * @Date 2019/6/6-11:19
 */
public class ProjectUtil {
    private static ProjectUtil projectUtil = new ProjectUtil();

    public static ProjectUtil getUtil() { return projectUtil; }


    /**
     * 根据数据类型得到相应的数据长度
     * @param infoType 数据单元类型
     * @return
     */
    public int getLength(int infoType){
        int num = 0;
        switch (infoType){
            case 1://上传建筑消防设施系统状态(共占10个字节,信息体占4个字节,时间占6个字节)
                num = 10;
                break;
            case 2://上传建筑消防设施部件运行状态(共占46个字节,信息体占40个字节,时间占6个字节)
                num = 46;
                break;
            case 3://上传建筑消防设施部件模拟量值(共16 个字节,信息体 10个字节,时间6个字节)
                num = 16;
                break;
            case 4://上传建筑消防设施操作信息(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 5://上传建筑消防设施软件版本(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 6://上传建筑消防设施系统配置情况(共n+9,信息体n+3个字节,时间6个字节)
                num = 9;
                break;
            case 7://上传建筑消防设施部件配置情况(共44个字节,信息体38个字节,时间6个字节)
                num = 44;
                break;
            case 8://上传建筑消防设施系统时间(时间6个字节)
                num = 6;
                break;
            case 21://上传用户信息传输装置运行状态(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            case 24://上传用户信息传输装置操作信息(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 25://上传用户信息传输装置软件版本(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 26://上传用户信息传输装置配置情况(共n+7个字节,信息体n+1个字节,时间6个字节)
                num = 7;
                break;
            case 28://上传用户信息传输装置系统时间(共6个字节,时间6个字节)
                num = 6;
                break;
            case 61://读建筑消防设施系统状态(共占10个字节,信息体占4个字节,时间占6个字节)
                num = 10;
                break;
            case 62://读建筑消防设施部件运行状态(共占46个字节,信息体占40个字节,时间占6个字节)
                num = 46;
                break;
            case 63://读建筑消防设施部件模拟量值(共16 个字节,信息体 10个字节,时间6个字节)
                num = 16;
                break;
            case 64://读建筑消防设施操作信息(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 65://读建筑消防设施软件版本(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 66://读建筑消防设施系统配置情况(共n+9,信息体n+3个字节,时间6个字节)
                num = 9;//暂定为9
                break;
            case 67://读建筑消防设施部件配置情况(共44个字节,信息体38个字节,时间6个字节)
                num = 44;
                break;
            case 68://读建筑消防设施系统时间(时间6个字节)
                num = 6;
                break;
            case 81://读用户信息传输装置运行状态(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            case 84://读用户信息传输装置操作信息(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 85://读用户信息传输装置软件版本(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 86://读用户信息传输装置配置情况(共n+7个字节,信息体n+1个字节,时间6个字节)
                num = 7;//暂定为7
                break;
            case 88://读用户信息传输装置系统时间(共6个字节,时间6个字节)
                num = 6;
                break;
            case 89://初始化用户信息传输装置(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            case 90://同步用户信息传输装置时钟(共6个字节,时间6个字节)
                num = 6;
                break;
            case 91://查岗命令(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            default:
                num = 0;//暂定为0
                break;
        }
        return num;
    }


    /**
     * 根据数据类型得到相应的数据长度<br/>
     *
     * @param infoType 数据单元类型
     * @param bytes 原数组
     * @return
     */
    public int getLength(int infoType,byte[] bytes){
        int num = 0;
        switch (infoType){
            case 1://上传建筑消防设施系统状态(共占10个字节,信息体占4个字节,时间占6个字节)
                num = 10;
                break;
            case 2://上传建筑消防设施部件运行状态(共占46个字节,信息体占40个字节,时间占6个字节)
                num = 46;
                break;
            case 3://上传建筑消防设施部件模拟量值(共16 个字节,信息体 10个字节,时间6个字节)
                num = 16;
                break;
            case 4://上传建筑消防设施操作信息(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 5://上传建筑消防设施软件版本(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 6://上传建筑消防设施系统配置情况(共n+9,信息体n+3个字节,时间6个字节)
                num = bytes[31]+9;
                //num = 9;
                break;
            case 7://上传建筑消防设施部件配置情况(共44个字节,信息体38个字节,时间6个字节)
                num = 44;
                break;
            case 8://上传建筑消防设施系统时间(时间6个字节)
                num = 6;
                break;
            case 21://上传用户信息传输装置运行状态(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            case 24://上传用户信息传输装置操作信息(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 25://上传用户信息传输装置软件版本(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 26://上传用户信息传输装置配置情况(共n+7个字节,信息体n+1个字节,时间6个字节)
                num = bytes[29] + 7;
                break;
            case 28://上传用户信息传输装置系统时间(共6个字节,时间6个字节)
                num = 6;
                break;
            case 61://读建筑消防设施系统状态(共占10个字节,信息体占4个字节,时间占6个字节)
                num = 10;
                break;
            case 62://读建筑消防设施部件运行状态(共占46个字节,信息体占40个字节,时间占6个字节)
                num = 46;
                break;
            case 63://读建筑消防设施部件模拟量值(共16 个字节,信息体 10个字节,时间6个字节)
                num = 16;
                break;
            case 64://读建筑消防设施操作信息(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 65://读建筑消防设施软件版本(共10个字节,信息体4个字节,时间6个字节)
                num = 10;
                break;
            case 66://读建筑消防设施系统配置情况(共n+9,信息体n+3个字节,时间6个字节)
                num = bytes[31]+9;
                break;
            case 67://读建筑消防设施部件配置情况(共44个字节,信息体38个字节,时间6个字节)
                num = 44;
                break;
            case 68://读建筑消防设施系统时间(时间6个字节)
                num = 6;
                break;
            case 81://读用户信息传输装置运行状态(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            case 84://读用户信息传输装置操作信息(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 85://读用户信息传输装置软件版本(共8个字节,信息体2个字节,时间6个字节)
                num = 8;
                break;
            case 86://读用户信息传输装置配置情况(共n+7个字节,信息体n+1个字节,时间6个字节)
                num = bytes[29] + 7;
                break;
            case 88://读用户信息传输装置系统时间(共6个字节,时间6个字节)
                num = 6;
                break;
            case 89://初始化用户信息传输装置(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            case 90://同步用户信息传输装置时钟(共6个字节,时间6个字节)
                num = 6;
                break;
            case 91://查岗命令(共7个字节,信息体1个字节,时间6个字节)
                num = 7;
                break;
            default:
                num = 0;//暂定为0
                break;
        }
        return num;
    }
}
